punesemu/puNES/src/c++/pic16c5x/pic16c5x_m.cpp
// license:BSD-3-Clause
// copyright-holders:Tony La Porta
	/**************************************************************************\
	*                      Microchip PIC16C5x Emulator                         *
	*                                                                          *
	*                    Copyright Tony La Porta                               *
	*                 Originally written for the MAME project.                 *
	*                                                                          *
	*                                                                          *
	*      Addressing architecture is based on the Harvard addressing scheme.  *
	*                                                                          *
	*                                                                          *
	*  **** Change Log ****                                                    *
	*  TLP (06-Apr-2003)                                                       *
	*   - First Public release.                                                *
	*  BO  (07-Apr-2003) Ver 1.01                                              *
	*   - Renamed 'sleep' function to 'sleepic' to avoid C conflicts.          *
	*  TLP (09-Apr-2003) Ver 1.10                                              *
	*   - Fixed modification of file register $03 (Status).                    *
	*   - Corrected support for 7FFh (12-bit) size ROMs.                       *
	*   - The 'call' and 'goto' instructions weren't correctly handling the    *
	*     STATUS page info correctly.                                          *
	*   - The FSR register was incorrectly oring the data with 0xe0 when read. *
	*   - Prescaler masking information was set to 3 instead of 7.             *
	*   - Prescaler assign bit was set to 4 instead of 8.                      *
	*   - Timer source and edge select flags/masks were wrong.                 *
	*   - Corrected the memory bank selection in GET/SET_REGFILE and also the  *
	*     indirect register addressing.                                        *
	*  BMP (18-May-2003) Ver 1.11                                              *
	*   - PIC16C5x_get_reg functions were missing 'returns'.                   *
	*  TLP (27-May-2003) Ver 1.12                                              *
	*   - Fixed the WatchDog timer count.                                      *
	*   - The Prescaler rate was incorrectly being zeroed, instead of the      *
	*     actual Prescaler counter in the CLRWDT and SLEEP instructions.       *
	*   - Added masking to the FSR register. Upper unused bits are always 1.   *
	*  TLP (27-Aug-2009) Ver 1.13                                              *
	*   - Indirect addressing was not taking into account special purpose      *
	*     memory mapped locations.                                             *
	*   - 'iorlw' instruction was saving the result to memory instead of       *
	*     the W register.                                                      *
	*   - 'tris' instruction no longer modifies Port-C on PIC models that      *
	*     do not have Port-C implemented.                                      *
	*  TLP (07-Sep-2009) Ver 1.14                                              *
	*   - Edge sense control for the T0 count input was incorrectly reversed   *
	*  LE (05-Feb-2017) Ver 1.15                                               *
	*   - Allow writing all bits of the status register except TO and PD.      *
	*     This enables e.g. bcf, bsf or clrf to change the flags when the      *
	*     status register is the destination.                                  *
	*   - Changed rlf and rrf to update the carry flag in the last step.       *
	*     Fixes the case where the status register is the destination.         *
	*  hap (12-Feb-2017) Ver 1.16                                              *
	*   - Added basic support for the old GI PIC1650 and PIC1655.              *
	*   - Made RTCC(aka T0CKI) pin an inputline handler.                       *
	*                                                                          *
	*                                                                          *
	*  **** Notes: ****                                                        *
	*  PIC WatchDog Timer has a separate internal clock. For the moment, we're *
	*     basing the count on a 4MHz input clock, since 4MHz is the typical    *
	*     input frequency (but by no means always).                            *
	*  A single scaler is available for the Counter/Timer or WatchDog Timer.   *
	*     When connected to the Counter/Timer, it functions as a Prescaler,    *
	*     hence prescale overflows, tick the Counter/Timer.                    *
	*     When connected to the WatchDog Timer, it functions as a Postscaler   *
	*     hence WatchDog Timer overflows, tick the Postscaler. This scenario   *
	*     means that the WatchDog timeout occurs when the Postscaler has       *
	*     reached the scaler rate value, not when the WatchDog reaches zero.   *
	*  CLRWDT should prevent the WatchDog Timer from timing out and generating *
	*     a device reset, but how is not known. The manual also mentions that  *
	*     the WatchDog Timer can only be disabled during ROM programming, and  *
	*     no other means seem to exist???                                      *
	*                                                                          *
	\**************************************************************************/

#include "pic16c5x_m.h"
#include "save_slot.h"

PIC16C5X::PIC16C5X(int program_width, int data_width, int picmodel, uint8_t *rom, pic16c5x_rd_funct _rd, pic16c5x_wr_funct _wr):
	m_rom(rom),
	m_picmodel(picmodel),
	m_temp_config(0),
	m_picRAMmask((1 << data_width) - 1),
	m_picROMmask((1 << program_width) - 1),
	m_read(_rd),
	m_write(_wr) {
	m_PC = 0;
	m_PREVPC = 0;
	m_W = 0;
	m_OPTION = 0;
	m_CONFIG = 0;
	m_ALU = 0;
	m_WDT = 0;
	m_TRISA = 0;
	m_TRISB = 0;
	m_TRISC = 0;
	m_prescaler = 0;
	m_icount = 0;
	m_delay_timer = 0;
	m_rtcc = 0;
	m_count_pending = 0;
	m_old_data = 0;
	m_inst_cycles = 0;
	m_clock2cycle = 0;
}

PIC16C54::PIC16C54(uint8_t *rom, pic16c5x_rd_funct _rd, pic16c5x_wr_funct _wr): PIC16C5X( 9, 5, 0x16C54, rom, _rd, _wr) {};
PIC16C55::PIC16C55(uint8_t *rom, pic16c5x_rd_funct _rd, pic16c5x_wr_funct _wr): PIC16C5X( 9, 5, 0x16C55, rom, _rd, _wr) {};
PIC16C56::PIC16C56(uint8_t *rom, pic16c5x_rd_funct _rd, pic16c5x_wr_funct _wr): PIC16C5X(10, 5, 0x16C56, rom, _rd, _wr) {};
PIC16C57::PIC16C57(uint8_t *rom, pic16c5x_rd_funct _rd, pic16c5x_wr_funct _wr): PIC16C5X(11, 7, 0x16C57, rom, _rd, _wr) {};
PIC16C58::PIC16C58(uint8_t *rom, pic16c5x_rd_funct _rd, pic16c5x_wr_funct _wr): PIC16C5X(11, 7, 0x16C58, rom, _rd, _wr) {};
PIC1650::PIC1650  (uint8_t *rom, pic16c5x_rd_funct _rd, pic16c5x_wr_funct _wr): PIC16C5X( 9, 5, 0x1650,  rom, _rd, _wr) {};
PIC1655::PIC1655  (uint8_t *rom, pic16c5x_rd_funct _rd, pic16c5x_wr_funct _wr): PIC16C5X( 9, 5, 0x1655,  rom, _rd, _wr) {};

#define M_RDRAM(A)      m_internalram[A &m_picRAMmask]
#define M_WRTRAM(A,V)   m_internalram[A &m_picRAMmask] =(V)
#define M_RDOP(A)       m_rom[(A &m_picROMmask) <<1 |0] | m_rom[(A &m_picROMmask) <<1 |1] <<8
#define ADDR_MASK       0x7ff

#define TMR0    m_internalram[1]
#define PCL     m_internalram[2]
#define STATUS  m_internalram[3]
#define FSR     m_internalram[4]
#define PORTA   m_internalram[5]
#define PORTB   m_internalram[6]
#define PORTC   m_internalram[7]
#define PORTD   m_internalram[8]
#define INDF    M_RDRAM(FSR)

