punesemu/puNES/src/c++/pic16c5x/pic16c5x_m.cpp
/* This following function is here to fill in the void for */
/* the opcode call function. This function is never called. */


void PIC16C5X::illegal()
{
	//printf("PIC16C5x:  PC=%03x,  Illegal opcode = %04x\n", (m_PC-1), m_opcode.s0);
}

/*
  Note:
  According to the manual, if the STATUS register is the destination for an instruction that affects the Z, DC or C bits
  then the write to these three bits is disabled. These bits are set or cleared according to the device logic.
  To ensure this is correctly emulated, in instructions that write to the file registers, always change the status flags
  *after* storing the result of the instruction.
  e.g. CALCULATE_*, SET(STATUS,*_FLAG) and CLR(STATUS,*_FLAG) should appear as the last steps of the instruction emulation.
*/

void PIC16C5X::addwf()
{
	m_old_data = GET_REGFILE(ADDR);
	m_ALU = m_old_data + m_W;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
	CALCULATE_ADD_CARRY();
	CALCULATE_ADD_DIGITCARRY();
}

void PIC16C5X::andwf()
{
	m_ALU = GET_REGFILE(ADDR) & m_W;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
}

void PIC16C5X::andlw()
{
	m_ALU = m_opcode.b0 & m_W;
	m_W = m_ALU;
	CALCULATE_Z_FLAG();
}

void PIC16C5X::bcf()
{
	m_ALU = GET_REGFILE(ADDR);
	m_ALU &= bit_clr[POS];
	STORE_REGFILE(ADDR, m_ALU);
}

void PIC16C5X::bsf()
{
	m_ALU = GET_REGFILE(ADDR);
	m_ALU |= bit_set[POS];
	STORE_REGFILE(ADDR, m_ALU);
}

void PIC16C5X::btfss()
{
	if ((GET_REGFILE(ADDR) & bit_set[POS]) == bit_set[POS])
	{
		m_PC++;
		PCL = m_PC & 0xff;
		m_inst_cycles += 1;     /* Add NOP cycles */
	}
}

void PIC16C5X::btfsc()
{
	if ((GET_REGFILE(ADDR) & bit_set[POS]) == 0)
	{
		m_PC++;
		PCL = m_PC & 0xff;
		m_inst_cycles += 1;     /* Add NOP cycles */
	}
}

void PIC16C5X::call()
{
	PUSH_STACK(m_PC);
	m_PC = ((STATUS & PA_REG) << 4) | m_opcode.b0;
	m_PC &= 0x6ff;
	PCL = m_PC & 0xff;
}

void PIC16C5X::clrw()
{
	m_W = 0;
	SET(STATUS, Z_FLAG);
}

void PIC16C5X::clrf()
{
	STORE_REGFILE(ADDR, 0);
	SET(STATUS, Z_FLAG);
}

void PIC16C5X::clrwdt()
{
	m_WDT = 0;
	if (PSA) m_prescaler = 0;
	SET(STATUS, TO_FLAG);
	SET(STATUS, PD_FLAG);
}

void PIC16C5X::comf()
{
	m_ALU = (uint8_t)(~(GET_REGFILE(ADDR)));
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
}

void PIC16C5X::decf()
{
	m_ALU = GET_REGFILE(ADDR) - 1;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
}

void PIC16C5X::decfsz()
{
	m_ALU = GET_REGFILE(ADDR) - 1;
	STORE_RESULT(ADDR, m_ALU);
	if (m_ALU == 0)
	{
		m_PC++;
		PCL = m_PC & 0xff;
		m_inst_cycles += 1;     /* Add NOP cycles */
	}
}

void PIC16C5X::goto_op()
{
	m_PC = ((STATUS & PA_REG) << 4) | (m_opcode.s0 & 0x1ff);
	m_PC &= ADDR_MASK;
	PCL = m_PC & 0xff;
}

void PIC16C5X::incf()
{
	m_ALU = GET_REGFILE(ADDR) + 1;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
}

void PIC16C5X::incfsz()
{
	m_ALU = GET_REGFILE(ADDR) + 1;
	STORE_RESULT(ADDR, m_ALU);
	if (m_ALU == 0)
	{
		m_PC++;
		PCL = m_PC & 0xff;
		m_inst_cycles += 1;     /* Add NOP cycles */
	}
}

void PIC16C5X::iorlw()
{
	m_ALU = m_opcode.b0 | m_W;
	m_W = m_ALU;
	CALCULATE_Z_FLAG();
}

void PIC16C5X::iorwf()
{
	m_ALU = GET_REGFILE(ADDR) | m_W;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
}

void PIC16C5X::movf()
{
	m_ALU = GET_REGFILE(ADDR);
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
}

void PIC16C5X::movlw()
{
	m_W = m_opcode.b0;
}

void PIC16C5X::movwf()
{
	STORE_REGFILE(ADDR, m_W);
}

void PIC16C5X::nop()
{
	/* Do nothing */
}

void PIC16C5X::option()
{
	m_OPTION = m_W & (T0CS_FLAG | T0SE_FLAG | PSA_FLAG | PS_REG);
}

void PIC16C5X::retlw()
{
	m_W = m_opcode.b0;
	m_PC = POP_STACK();
	PCL = m_PC & 0xff;
}

void PIC16C5X::rlf()
{
	m_ALU = GET_REGFILE(ADDR);
	uint8_t bit7 = m_ALU & 0x80;
	m_ALU <<= 1;
	if (STATUS & C_FLAG) m_ALU |= 1;
	STORE_RESULT(ADDR, m_ALU);
	if (bit7) SET(STATUS, C_FLAG);
	else CLR(STATUS, C_FLAG);
}

void PIC16C5X::rrf()
{
	m_ALU = GET_REGFILE(ADDR);
	uint8_t bit0 = m_ALU & 1;
	m_ALU >>= 1;
	if (STATUS & C_FLAG) m_ALU |= 0x80;
	STORE_RESULT(ADDR, m_ALU);
	if (bit0) SET(STATUS, C_FLAG);
	else CLR(STATUS, C_FLAG);
}

void PIC16C5X::sleepic()
{
	if (WDTE) m_WDT = 0;
	if (PSA) m_prescaler = 0;
	SET(STATUS, TO_FLAG);
	CLR(STATUS, PD_FLAG);
}

void PIC16C5X::subwf()
{
	m_old_data = GET_REGFILE(ADDR);
	m_ALU = m_old_data - m_W;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
	CALCULATE_SUB_CARRY();
	CALCULATE_SUB_DIGITCARRY();
}

void PIC16C5X::swapf()
{
	m_ALU  = ((GET_REGFILE(ADDR) << 4) & 0xf0);
	m_ALU |= ((GET_REGFILE(ADDR) >> 4) & 0x0f);
	STORE_RESULT(ADDR, m_ALU);
}

void PIC16C5X::tris()
{
	switch(m_opcode.b0 & 0x7)
	{
		case 5:     if   (m_TRISA == m_W) break;
					else { m_TRISA = m_W | 0xf0; m_write(PIC16C5x_PORTA, 0x1000 | (PORTA & (uint8_t)(~m_TRISA) & 0x0f)); break; }
		case 6:     if   (m_TRISB == m_W) break;
					else { m_TRISB = m_W; m_write(PIC16C5x_PORTB, 0x1000 | (PORTB & (uint8_t)(~m_TRISB))); break; }
		case 7:     if ((m_picmodel == 0x16C55) || (m_picmodel == 0x16C57)) {
						if   (m_TRISC == m_W) break;
						else { m_TRISC = m_W; m_write(PIC16C5x_PORTC, 0x1000 | (PORTC & (uint8_t)(~m_TRISC))); break; }
					}
					else {
						illegal(); break;
					}
		default:    illegal(); break;
	}
}

void PIC16C5X::xorlw()
{
	m_ALU = m_W ^ m_opcode.b0;
	m_W = m_ALU;
	CALCULATE_Z_FLAG();
}

void PIC16C5X::xorwf()
{
	m_ALU = GET_REGFILE(ADDR) ^ m_W;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
}




/***********************************************************************
 *  Opcode Table (Cycles, Instruction)
 ***********************************************************************/

const PIC16C5X::PIC16C5x_opcode PIC16C5X::s_opcode_main[256]=
{
/*00*/  {1, &PIC16C5X::nop     },{1, &PIC16C5X::illegal   },{1, &PIC16C5X::movwf     },{1, &PIC16C5X::movwf     },
		{1, &PIC16C5X::clrw    },{1, &PIC16C5X::illegal   },{1, &PIC16C5X::clrf      },{1, &PIC16C5X::clrf      },
/*08*/  {1, &PIC16C5X::subwf   },{1, &PIC16C5X::subwf     },{1, &PIC16C5X::subwf     },{1, &PIC16C5X::subwf     },
		{1, &PIC16C5X::decf    },{1, &PIC16C5X::decf      },{1, &PIC16C5X::decf      },{1, &PIC16C5X::decf      },
/*10*/  {1, &PIC16C5X::iorwf   },{1, &PIC16C5X::iorwf     },{1, &PIC16C5X::iorwf     },{1, &PIC16C5X::iorwf     },
		{1, &PIC16C5X::andwf   },{1, &PIC16C5X::andwf     },{1, &PIC16C5X::andwf     },{1, &PIC16C5X::andwf     },
/*18*/  {1, &PIC16C5X::xorwf   },{1, &PIC16C5X::xorwf     },{1, &PIC16C5X::xorwf     },{1, &PIC16C5X::xorwf     },
		{1, &PIC16C5X::addwf   },{1, &PIC16C5X::addwf     },{1, &PIC16C5X::addwf     },{1, &PIC16C5X::addwf     },
/*20*/  {1, &PIC16C5X::movf    },{1, &PIC16C5X::movf      },{1, &PIC16C5X::movf      },{1, &PIC16C5X::movf      },
		{1, &PIC16C5X::comf    },{1, &PIC16C5X::comf      },{1, &PIC16C5X::comf      },{1, &PIC16C5X::comf      },
/*28*/  {1, &PIC16C5X::incf    },{1, &PIC16C5X::incf      },{1, &PIC16C5X::incf      },{1, &PIC16C5X::incf      },
		{1, &PIC16C5X::decfsz  },{1, &PIC16C5X::decfsz    },{1, &PIC16C5X::decfsz    },{1, &PIC16C5X::decfsz    },
/*30*/  {1, &PIC16C5X::rrf     },{1, &PIC16C5X::rrf       },{1, &PIC16C5X::rrf       },{1, &PIC16C5X::rrf       },
		{1, &PIC16C5X::rlf     },{1, &PIC16C5X::rlf       },{1, &PIC16C5X::rlf       },{1, &PIC16C5X::rlf       },
/*38*/  {1, &PIC16C5X::swapf   },{1, &PIC16C5X::swapf     },{1, &PIC16C5X::swapf     },{1, &PIC16C5X::swapf     },
		{1, &PIC16C5X::incfsz  },{1, &PIC16C5X::incfsz    },{1, &PIC16C5X::incfsz    },{1, &PIC16C5X::incfsz    },
/*40*/  {1, &PIC16C5X::bcf     },{1, &PIC16C5X::bcf       },{1, &PIC16C5X::bcf       },{1, &PIC16C5X::bcf       },
		{1, &PIC16C5X::bcf     },{1, &PIC16C5X::bcf       },{1, &PIC16C5X::bcf       },{1, &PIC16C5X::bcf       },
/*48*/  {1, &PIC16C5X::bcf     },{1, &PIC16C5X::bcf       },{1, &PIC16C5X::bcf       },{1, &PIC16C5X::bcf       },
		{1, &PIC16C5X::bcf     },{1, &PIC16C5X::bcf       },{1, &PIC16C5X::bcf       },{1, &PIC16C5X::bcf       },
/*50*/  {1, &PIC16C5X::bsf     },{1, &PIC16C5X::bsf       },{1, &PIC16C5X::bsf       },{1, &PIC16C5X::bsf       },
		{1, &PIC16C5X::bsf     },{1, &PIC16C5X::bsf       },{1, &PIC16C5X::bsf       },{1, &PIC16C5X::bsf       },
/*58*/  {1, &PIC16C5X::bsf     },{1, &PIC16C5X::bsf       },{1, &PIC16C5X::bsf       },{1, &PIC16C5X::bsf       },
		{1, &PIC16C5X::bsf     },{1, &PIC16C5X::bsf       },{1, &PIC16C5X::bsf       },{1, &PIC16C5X::bsf       },
/*60*/  {1, &PIC16C5X::btfsc   },{1, &PIC16C5X::btfsc     },{1, &PIC16C5X::btfsc     },{1, &PIC16C5X::btfsc     },
		{1, &PIC16C5X::btfsc   },{1, &PIC16C5X::btfsc     },{1, &PIC16C5X::btfsc     },{1, &PIC16C5X::btfsc     },
/*68*/  {1, &PIC16C5X::btfsc   },{1, &PIC16C5X::btfsc     },{1, &PIC16C5X::btfsc     },{1, &PIC16C5X::btfsc     },
		{1, &PIC16C5X::btfsc   },{1, &PIC16C5X::btfsc     },{1, &PIC16C5X::btfsc     },{1, &PIC16C5X::btfsc     },
/*70*/  {1, &PIC16C5X::btfss   },{1, &PIC16C5X::btfss     },{1, &PIC16C5X::btfss     },{1, &PIC16C5X::btfss     },
		{1, &PIC16C5X::btfss   },{1, &PIC16C5X::btfss     },{1, &PIC16C5X::btfss     },{1, &PIC16C5X::btfss     },
/*78*/  {1, &PIC16C5X::btfss   },{1, &PIC16C5X::btfss     },{1, &PIC16C5X::btfss     },{1, &PIC16C5X::btfss     },
		{1, &PIC16C5X::btfss   },{1, &PIC16C5X::btfss     },{1, &PIC16C5X::btfss     },{1, &PIC16C5X::btfss     },
/*80*/  {2, &PIC16C5X::retlw   },{2, &PIC16C5X::retlw     },{2, &PIC16C5X::retlw     },{2, &PIC16C5X::retlw     },
		{2, &PIC16C5X::retlw   },{2, &PIC16C5X::retlw     },{2, &PIC16C5X::retlw     },{2, &PIC16C5X::retlw     },
/*88*/  {2, &PIC16C5X::retlw   },{2, &PIC16C5X::retlw     },{2, &PIC16C5X::retlw     },{2, &PIC16C5X::retlw     },
		{2, &PIC16C5X::retlw   },{2, &PIC16C5X::retlw     },{2, &PIC16C5X::retlw     },{2, &PIC16C5X::retlw     },
/*90*/  {2, &PIC16C5X::call    },{2, &PIC16C5X::call      },{2, &PIC16C5X::call      },{2, &PIC16C5X::call      },
		{2, &PIC16C5X::call    },{2, &PIC16C5X::call      },{2, &PIC16C5X::call      },{2, &PIC16C5X::call      },
/*98*/  {2, &PIC16C5X::call    },{2, &PIC16C5X::call      },{2, &PIC16C5X::call      },{2, &PIC16C5X::call      },
		{2, &PIC16C5X::call    },{2, &PIC16C5X::call      },{2, &PIC16C5X::call      },{2, &PIC16C5X::call      },
/*A0*/  {2, &PIC16C5X::goto_op },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },
		{2, &PIC16C5X::goto_op },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },
/*A8*/  {2, &PIC16C5X::goto_op },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },
		{2, &PIC16C5X::goto_op },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },
/*B0*/  {2, &PIC16C5X::goto_op },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },
		{2, &PIC16C5X::goto_op },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },
/*B8*/  {2, &PIC16C5X::goto_op },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },
		{2, &PIC16C5X::goto_op },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },{2, &PIC16C5X::goto_op   },
/*C0*/  {1, &PIC16C5X::movlw   },{1, &PIC16C5X::movlw     },{1, &PIC16C5X::movlw     },{1, &PIC16C5X::movlw     },
		{1, &PIC16C5X::movlw   },{1, &PIC16C5X::movlw     },{1, &PIC16C5X::movlw     },{1, &PIC16C5X::movlw     },
/*C8*/  {1, &PIC16C5X::movlw   },{1, &PIC16C5X::movlw     },{1, &PIC16C5X::movlw     },{1, &PIC16C5X::movlw     },
		{1, &PIC16C5X::movlw   },{1, &PIC16C5X::movlw     },{1, &PIC16C5X::movlw     },{1, &PIC16C5X::movlw     },
/*D0*/  {1, &PIC16C5X::iorlw   },{1, &PIC16C5X::iorlw     },{1, &PIC16C5X::iorlw     },{1, &PIC16C5X::iorlw     },
		{1, &PIC16C5X::iorlw   },{1, &PIC16C5X::iorlw     },{1, &PIC16C5X::iorlw     },{1, &PIC16C5X::iorlw     },
/*D8*/  {1, &PIC16C5X::iorlw   },{1, &PIC16C5X::iorlw     },{1, &PIC16C5X::iorlw     },{1, &PIC16C5X::iorlw     },
		{1, &PIC16C5X::iorlw   },{1, &PIC16C5X::iorlw     },{1, &PIC16C5X::iorlw     },{1, &PIC16C5X::iorlw     },
/*E0*/  {1, &PIC16C5X::andlw   },{1, &PIC16C5X::andlw     },{1, &PIC16C5X::andlw     },{1, &PIC16C5X::andlw     },
		{1, &PIC16C5X::andlw   },{1, &PIC16C5X::andlw     },{1, &PIC16C5X::andlw     },{1, &PIC16C5X::andlw     },
/*E8*/  {1, &PIC16C5X::andlw   },{1, &PIC16C5X::andlw     },{1, &PIC16C5X::andlw     },{1, &PIC16C5X::andlw     },
		{1, &PIC16C5X::andlw   },{1, &PIC16C5X::andlw     },{1, &PIC16C5X::andlw     },{1, &PIC16C5X::andlw     },
/*F0*/  {1, &PIC16C5X::xorlw   },{1, &PIC16C5X::xorlw     },{1, &PIC16C5X::xorlw     },{1, &PIC16C5X::xorlw     },
		{1, &PIC16C5X::xorlw   },{1, &PIC16C5X::xorlw     },{1, &PIC16C5X::xorlw     },{1, &PIC16C5X::xorlw     },
/*F8*/  {1, &PIC16C5X::xorlw   },{1, &PIC16C5X::xorlw     },{1, &PIC16C5X::xorlw     },{1, &PIC16C5X::xorlw     },
		{1, &PIC16C5X::xorlw   },{1, &PIC16C5X::xorlw     },{1, &PIC16C5X::xorlw     },{1, &PIC16C5X::xorlw     }
};


const PIC16C5X::PIC16C5x_opcode PIC16C5X::s_opcode_00x[16]=
{
/*00*/  {1, &PIC16C5X::nop     },{1, &PIC16C5X::illegal   },{1, &PIC16C5X::option    },{1, &PIC16C5X::sleepic   },
		{1, &PIC16C5X::clrwdt  },{1, &PIC16C5X::tris      },{1, &PIC16C5X::tris      },{1, &PIC16C5X::tris      },
/*08*/  {1, &PIC16C5X::illegal },{1, &PIC16C5X::illegal   },{1, &PIC16C5X::illegal   },{1, &PIC16C5X::illegal   },
		{1, &PIC16C5X::illegal },{1, &PIC16C5X::illegal   },{1, &PIC16C5X::illegal   },{1, &PIC16C5X::illegal   }
};



/****************************************************************************
 *  Inits CPU emulation
 ****************************************************************************/

enum
{
	PIC16C5x_PC=1, PIC16C5x_STK0, PIC16C5x_STK1, PIC16C5x_FSR,
	PIC16C5x_W,    PIC16C5x_ALU,  PIC16C5x_STR,  PIC16C5x_OPT,
	PIC16C5x_TMR0, PIC16C5x_PRTA, PIC16C5x_PRTB, PIC16C5x_PRTC, PIC16C5x_PRTD,
	PIC16C5x_WDT,  PIC16C5x_TRSA, PIC16C5x_TRSB, PIC16C5x_TRSC,
	PIC16C5x_PSCL
};

/****************************************************************************
 *  Reset registers to their initial values
 ****************************************************************************/

void PIC16C5X::PIC16C5x_reset_regs()
{
	m_PC     = m_picROMmask;
	m_CONFIG = m_temp_config;
	m_TRISA  = 0xff;
	m_TRISB  = 0xff;
	m_TRISC  = 0xff;
	m_OPTION = (T0CS_FLAG | T0SE_FLAG | PSA_FLAG | PS_REG);
	PCL    = 0xff;
	FSR   |= (uint8_t)(~m_picRAMmask);
	m_prescaler = 0;
	m_delay_timer = 0;
	m_inst_cycles = 0;
	m_count_pending = false;
}

