punesemu/puNES/src/c++/pic16c5x/pic16c5x_m.cpp
void PIC16C5X::reset(uint8_t reset_type)
{
	if (reset_type >= HARD) {
		for (auto &c: m_internalram) c = 0;
		PIC16C5x_reset_regs();
		CLR(STATUS, PA_REG);
		SET(STATUS, (TO_FLAG | PD_FLAG));
		m_icount = 0;
		m_clock2cycle = 0;
	} else {
		SET(STATUS, (TO_FLAG | PD_FLAG | Z_FLAG | DC_FLAG | C_FLAG));
		PIC16C5x_reset_regs();
	}
}

void PIC16C5X::set_config(uint16_t data)
{
	m_temp_config = data;
}



/****************************************************************************
 *  WatchDog
 ****************************************************************************/

void PIC16C5X::PIC16C5x_update_watchdog(int counts)
{
	/* WatchDog is set up to count 18,000 (0x464f hex) ticks to provide */
	/* the timeout period of 0.018ms based on a 4MHz input clock. */
	/* Note: the 4MHz clock should be divided by the PIC16C5x_CLOCK_DIVIDER */
	/* which effectively makes the PIC run at 1MHz internally. */

	/* If the current instruction is CLRWDT or SLEEP, don't update the WDT */

	if ((m_opcode.s0 != 3) && (m_opcode.s0 != 4))
	{
		uint16_t old_WDT = m_WDT;

		m_WDT -= counts;

		if (m_WDT > 0x464f) {
			m_WDT = 0x464f - (0xffff - m_WDT);
		}

		if (((old_WDT != 0) && (old_WDT < m_WDT)) || (m_WDT == 0))
		{
			if (PSA) {
				m_prescaler++;
				if (m_prescaler >= (1 << PS)) { /* Prescale values from 1 to 128 */
					m_prescaler = 0;
					CLR(STATUS, TO_FLAG);
					//PIC16C5x_soft_reset();
				}
			}
			else {
				CLR(STATUS, TO_FLAG);
				//PIC16C5x_soft_reset();
			}
		}
	}
}


/****************************************************************************
 *  Update Timer
 ****************************************************************************/

void PIC16C5X::PIC16C5x_update_timer(int counts)
{
	if (PSA == 0) {
		m_prescaler += counts;
		if (m_prescaler >= (2 << PS)) { /* Prescale values from 2 to 256 */
			TMR0 += (m_prescaler / (2 << PS));
			m_prescaler %= (2 << PS);   /* Overflow prescaler */
		}
	}
	else {
		TMR0 += counts;
	}
}

void PIC16C5X::set_input(int line, int state)
{
	switch (line)
	{
		/* RTCC/T0CKI pin */
		case PIC16C5x_RTCC:
			if (T0CS && state != m_rtcc) /* Count mode, edge triggered */
				if ((T0SE && !state) || (!T0SE && state))
					m_count_pending = true;

			m_rtcc = state;
			break;

		default:
			break;
	}
}


void PIC16C5X::run()
{
	if ((++m_clock2cycle &3) ==0) m_icount++;

	while (m_icount > 0) {
		if (PD == 0) /* Sleep Mode */
		{
			m_count_pending = false;
			m_inst_cycles = 1;
			if (WDTE) {
				PIC16C5x_update_watchdog(1);
			}
		}
		else
		{
			if (m_count_pending) { /* RTCC/T0CKI clocked while in Count mode */
				m_count_pending = false;
				PIC16C5x_update_timer(1);
			}

			m_PREVPC = m_PC;

			m_opcode.s0 = M_RDOP(m_PC);
			//printf("%04X: %03X %03X\n", m_PC, m_opcode.s0, m_opcode.b0);
			m_PC++;
			PCL++;

			if (m_picmodel == 0x1650 || m_picmodel == 0x1655 || (m_opcode.s0 & 0xff0) != 0x000) { /* Do all opcodes except the 00? ones */
				m_inst_cycles = s_opcode_main[((m_opcode.s0 >> 4) & 0xff)].cycles;
				(this->*s_opcode_main[((m_opcode.s0 >> 4) & 0xff)].function)();
			}
			else {  /* Opcode 0x00? has many opcodes in its minor nibble */
				m_inst_cycles = s_opcode_00x[(m_opcode.b0 & 0x1f)].cycles;
				(this->*s_opcode_00x[(m_opcode.b0 & 0x1f)].function)();
			}

			if (!T0CS) { /* Timer mode */
				if (m_delay_timer) {
					m_delay_timer--;
				}
				else {
					PIC16C5x_update_timer(m_inst_cycles);
				}
			}
			if (WDTE) {
				PIC16C5x_update_watchdog(m_inst_cycles);
			}
		}

		m_icount -= m_inst_cycles;

	} 
}

BYTE PIC16C5X::save_mapper(BYTE mode, BYTE slot, FILE *fp) {
	save_slot_ele(mode, slot, m_PC);
	save_slot_ele(mode, slot, m_PREVPC);
	save_slot_ele(mode, slot, m_W);
	save_slot_ele(mode, slot, m_OPTION);
	save_slot_ele(mode, slot, m_CONFIG);
	save_slot_ele(mode, slot, m_ALU);
	save_slot_ele(mode, slot, m_WDT);
	save_slot_ele(mode, slot, m_TRISA);
	save_slot_ele(mode, slot, m_TRISB);
	save_slot_ele(mode, slot, m_TRISC);
	save_slot_ele(mode, slot, m_STACK);
	save_slot_ele(mode, slot, m_prescaler);
	save_slot_ele(mode, slot, m_opcode.s0);
	save_slot_ele(mode, slot, m_internalram);
	save_slot_ele(mode, slot, m_icount);
	save_slot_ele(mode, slot, m_delay_timer);
	save_slot_ele(mode, slot, m_rtcc);
	save_slot_ele(mode, slot, m_count_pending);
	save_slot_ele(mode, slot, m_inst_cycles);
	save_slot_ele(mode, slot, m_clock2cycle);

	return (EXIT_OK);
}
